tuya/tuya-iotos-embeded-sdk-wifi-ble-bk7231n/platforms/bk7231n/bk7231n_os/beken378/driver/ble/ble_pub/plf/refip/src/arch/BK3435_reg.h

#ifndef _BK3433_REG_H_
#define _BK3433_REG_H_



/////////////////////////////////////////////////////////////////////////////
//memory layout
/////////////////////////////////////////////////////////////////////////////
#define ROM_START_ADDR           0x00000000
#define RAM_START_ADDR           0x00400000

#define AHB0_ICU_BASE            0x00800000
#define AHB1_XVR_BASE            0x00801400
#define AHB_FLASH_BASE			 0x00802000
#define AHB6_AHB2APB_BASE        0x00806000
#define AHB10_RW_REG_BASE        0x00810000
#define AHB14_RW_EM_BASE         0x00814000

#define APB0_WDT_BASE            0x00806000
#define APB1_PWM_BASE            0x00806100
#define APB2_SPI_BASE            0x00806200
#define APB3_UART_BASE           0x00806300
#define APB4_I2C_BASE            0x00806400
#define APB5_GPIO_BASE           0x00806500
#define APB6_RTC_BASE            0x00806600
#define APB7_ADC_BASE            0x00806700

#define APB_BLE_BASE             0x00802000 

#define p_AHB0_ICU_BASE          (*((volatile unsigned long *)  0x00800000))
#define p_AHB1_XVR_BASE          (*((volatile unsigned long *)  0x00801400))
#define p_AHB3_MFC_BASE          (*((volatile unsigned long *)  0x00803000))
#define p_AHB6_AHB2APB_BASE      (*((volatile unsigned long *)  0x00806000))
#define p_AHB1_RW_REG_BASE      (*((volatile unsigned long *)  0x00810000))
#define p_AHB1_RW_EM_BASE       (*((volatile unsigned long *)  0x00814000))
    
#define p_APB0_WDT_BASE          (*((volatile unsigned long *)  0x00806000))
#define p_APB1_PWM_BASE          (*((volatile unsigned long *)  0x00806100))
#define p_APB2_SPI_BASE          (*((volatile unsigned long *)  0x00806200))
#define p_APB3_UART_BASE         (*((volatile unsigned long *)  0x00806300))
#define p_APB4_I2C_BASE          (*((volatile unsigned long *)  0x00806400))
#define p_APB5_GPIO_BASE         (*((volatile unsigned long *)  0x00806500))
#define p_APB6_RTC_BASE          (*((volatile unsigned long *)  0x00806600))
#define p_APB7_ADC_BASE          (*((volatile unsigned long *)  0x00806700))

/////////////////////////////////////////////////////////////////////////////
//register definition
/////////////////////////////////////////////////////////////////////////////
//ICU register definitions
#define REG_AHB0_ICU_CLKSRCSEL             (*((volatile unsigned long *)   0x00800000))
#define SET_CLK_SEL_32K                    0x0
#define SET_CLK_SEL_16M                    0x1
#define SET_CLK_SEL_48M                    0x3

#define REG_AHB0_ICU_CORECLKCON            (*((volatile unsigned long *)   0x00800004))
#define BIT_CORE_CLK_DIV                   1

#define REG_AHB0_ICU_ADCCLKCON             (*((volatile unsigned long *)   0x00800008))
#define REG_AHB0_ICU_UARTCLKCON            (*((volatile unsigned long *)   0x0080000c))
#define REG_AHB0_ICU_I2CCLKCON             (*((volatile unsigned long *)   0x00800010))
#define REG_AHB0_ICU_SPICLKCON             (*((volatile unsigned long *)   0x00800014))
#define REG_AHB0_ICU_BLECLKCON             (*((volatile unsigned long *)   0x00800018))
#define REG_AHB0_ICU_WDTCLKCON             (*((volatile unsigned long *)   0x0080001c))
#define REG_AHB0_ICU_RNGCLKCON             (*((volatile unsigned long *)   0x00800020))
#define REG_AHB0_ICU_PWMCLKCON             (*((volatile unsigned long *)   0x00800024))
#define BIT_PWM_CLK_SEL                    1
#define SET_PWM_CLK_SEL                    (0x1 << BIT_PWM_CLK_SEL)

#define REG_AHB0_ICU_RTCCLKCON             (*((volatile unsigned long *)   0x00800028))

#define REG_AHB0_ICU_LPO_CLK_ON            (*((volatile unsigned long *)   0x0080002C))

#define REG_AHB0_ICU_CLK32K_SEL            (*((volatile unsigned long *)   0x00800030))
#define REG_AHB0_ICU_ANA_CTL          	   (*((volatile unsigned long *)   0x00800034))
	
#define REG_AHB0_ICU_CPU_STATUS            (*((volatile unsigned long *)   0x00800038))
		
#define REG_AHB0_ICU_INT_ENABLE            (*((volatile unsigned long *)   0x00800040))
#define REG_AHB0_ICU_IRQ_ENABLE            (*((volatile unsigned long *)   0x00800044))
#define REG_AHB0_ICU_INT_FLAG              (*((volatile unsigned long *)   0x00800048))
#define REG_AHB0_ICU_FLASH                 (*((volatile unsigned long *)   0x0080004c))
#define REG_AHB0_ICU_ANALOG_MODE           (*((volatile unsigned long *)   0x00800050))
#define REG_AHB0_ICU_ANALOG0_PWD           (*((volatile unsigned long *)   0x00800054))
#define REG_AHB0_ICU_ANALOG1_PWD           (*((volatile unsigned long *)   0x00800058))
#define REG_AHB0_ICU_DIGITAL_PWD           (*((volatile unsigned long *)   0x0080005c))

//Digital PWD Bit
#define BIT_ANA_TEST_PIN                   5
#define BIT_BB_TEST_PIN                    4
#define BIT_CLK16M_PWD                     3
#define BIT_HP_LDO_PWD                     2
#define BIT_CLK48M_PWD                     1
#define BIT_CB_BAIS_PWD                    0
#define SET_ANA_TEST_PIN                   (0x01 << BIT_ANA_TEST_PIN) 
#define SET_BB_TEST_PIN                    (0x01 << BIT_BB_TEST_PIN) 
#define SET_CLK16M_PWD                     (0x01 << BIT_CLK16M_PWD ) 
#define SET_HP_LDO_PWD                     (0x01 << BIT_HP_LDO_PWD ) 
#define SET_CLK48M_PWD                     (0x01 << BIT_CLK48M_PWD ) 
#define SET_CB_BAIS_PWD                    (0x01 << BIT_CB_BAIS_PWD) 


#define ICU_POWER_CONTROL_JTAG_MODE_POSI    9
#define ICU_POWER_CONTROL_JTAG_MODE_MASK    (0x01UL << ICU_POWER_CONTROL_JTAG_MODE_POSI)

#define CLOSE_JTAG_MODE()                   do {REG_AHB0_ICU_CLKSRCSEL &= (~ICU_POWER_CONTROL_JTAG_MODE_MASK);} while(0)
#define OPEN_JTAG_MODE()                    do {REG_AHB0_ICU_CLKSRCSEL |= ( ICU_POWER_CONTROL_JTAG_MODE_MASK);} while(0)



// DEEP_SLEEP0 is GPIO-A to GPIO-D deep sleep wake-en
// DEEP_SLEEP1 is GPIO-E deep sleep wake-en and deep sleep word
#define REG_AHB0_ICU_DEEP_SLEEP0           (*((volatile unsigned long *)   0x00800060))
#define REG_AHB0_ICU_DEEP_SLEEP1           (*((volatile unsigned long *)   0x00800064))
#define BIT_GPIOA_WAKERNEL_EN                  0
#define BIT_GPIOB_WAKERNEL_EN                  8
#define BIT_GPIOC_WAKERNEL_EN                  16
#define BIT_GPIOD_WAKERNEL_EN                  24
#define BIT_GPIOE_WAKERNEL_EN                  0
#define BIT_DEEP_SLEEP_WORD                16
#define SET_DEEP_SLEEP_WORD                (0xFFFF << BIT_DEEP_SLEEP_WORD)

