tuya/tuya-iotos-embeded-sdk-wifi-ble-bk7231n/platforms/bk7231n/bk7231n_os/beken378/driver/ble/ble_pub/plf/refip/src/arch/BK3435_reg.h
#define REG_AHB0_ICU_RC32K_CONFG           (*((volatile unsigned long *)   0x00800068))
#define REG_AHB0_ICU_SLEEP_TIME            (*((volatile unsigned long *)   0x0080006C))
#define BIT_MANU_FIN                       8
#define BIT_MANU_CIN                       3
#define BIT_MANU_EN                        2
#define BIT_CALI_MODE                      1
#define BIT_SPI_TRIG                       0
#define SET_MANU_FIN                       (0x1FF<< BIT_MANU_FIN )
#define SET_MANU_CIN                       (0x1F << BIT_MANU_CIN )
#define SET_MANU_EN                        (0x1  << BIT_MANU_EN  )
#define SET_CALI_MODE                      (0x1  << BIT_CALI_MODE)
#define SET_SPI_TRIG                       (0x1  << BIT_SPI_TRIG )



//FIQ
#define INT_STATUS_PWM0_bit     (0x01<<0)
#define INT_STATUS_LBD_bit      (0x01<<10)
#define INT_STATUS_BLE_bit      (0x01<<30)
//IRQ

#define INT_STATUS_SDM_bit      (0x01<<17)
#define INT_STATUS_RTC_bit      (0x01<<12)
#define INT_STATUS_RNG_bit      (0x01<<11)
#define INT_STATUS_GPIO_bit     (0x01<< 9)
#define INT_STATUS_ADC_bit      (0x01<< 8)
#define INT_STATUS_I2C_bit      (0x01<< 7)
#define INT_STATUS_SPI_bit      (0x01<< 6)
#define INT_STATUS_UART_bit     (0x01<< 5)
#define INT_STATUS_PWM4_bit     (0x01<< 4)
#define INT_STATUS_PWM3_bit     (0x01<< 3)
#define INT_STATUS_PWM2_bit     (0x01<< 2)
#define INT_STATUS_PWM1_bit     (0x01<< 1)

#define INT_IRQ_BIT             (0x01<<0)
#define FIQ_IRQ_BIT             (0x01<<1)

//RF register definitions
//=====================================================================================



//=====================================================================================
//FLASH
//=====================================================================================
#define REG_FLASH_OPERATE_SW            (*((volatile unsigned long *)   (AHB_FLASH_BASE+0*4)))
#define REG_FLASH_DATA_SW_FLASH         (*((volatile unsigned long *)   (AHB_FLASH_BASE+1*4)))
#define REG_FLASH_DATA_FLASH_SW         (*((volatile unsigned long *)   (AHB_FLASH_BASE+2*4)))
#define REG_FLASH_RDID_DATA_FLASH       (*((volatile unsigned long *)   (AHB_FLASH_BASE+4*4)))
#define REG_FLASH_SR_DATA_CRC_CNT       (*((volatile unsigned long *)   (AHB_FLASH_BASE+5*4)))
#define REG_FLASH_CONF                  (*((volatile unsigned long *)   (AHB_FLASH_BASE+7*4)))
#define flash_200k_ADDR                 (*((volatile unsigned long *)    (0x00032000)))
#define BIT_ADDRESS_SW                  0
#define BIT_OP_TYPE_SW                  24
#define BIT_OP_SW                       29
#define BIT_WP_VALUE                    30
#define BIT_BUSY_SW                     31

#define SET_ADDRESS_SW                  0xFFFFFF << BIT_ADDRESS_SW
#define SET_OP_TYPE_SW                  0x1F     << BIT_OP_TYPE_SW
#define SET_OP_SW                       0x1      << BIT_OP_SW
#define SET_WP_VALUE                    0x1      << BIT_WP_VALUE
#define SET_BUSY_SW                     0x1      << BIT_BUSY_SW

#define BIT_FLASH_CLK_CONF              0
#define BIT_MODE_SEL                    4
#define BIT_FWREN_FLASH_CPU             9
#define BIT_WRSR_DATA                   10
#define BIT_CRC_EN                      26

#define SET_FLASH_CLK_CONF              0xF      << BIT_FLASH_CLK_CONF
#define SET_MODE_SEL                    0x1F     << BIT_MODE_SEL
#define SET_FWREN_FLASH_CPU             0x1      << BIT_FWREN_FLASH_CPU
#define SET_WRSR_DATA                   0xFFFF   << BIT_WRSR_DATA
#define SET_CRC_EN                      0x1      << BIT_CRC_EN

#define BIT_SR_DATA_FLASH               0
#define BIT_CRC_ERR_COUNTER             8
#define BIT_DATA_FLASH_SW_SEL           16
#define BIT_DATA_SW_FLASH_SEL           19

#define SET_SR_DATA_FLASH               0xFF     << BIT_SR_DATA_FLASH
#define SET_CRC_ERR_COUNTER             0xFF     << BIT_CRC_ERR_COUNTER
#define SET_DATA_FLASH_SW_SEL           0x7      << BIT_DATA_FLASH_SW_SEL
#define SET_DATA_SW_FLASH_SEL           0x7      << BIT_DATA_SW_FLASH_SEL

//WDT
#define REG_APB0_WDT_CFG                (*((volatile unsigned long *)   0x00806000))


//=====================================================================================
//PWM
//=====================================================================================


#define REG_APB1_PWM_CFG                  			(*((volatile unsigned long *)   (APB1_PWM_BASE + 0*0x04)))

#define REG_APB1_PWM_INT_STATUS  					(*((volatile unsigned long *)   (APB1_PWM_BASE + 0x01*0x04)))
               
#define REG_APB1_PWM0_VALUE_CFG 					(*((volatile unsigned long *)   (APB1_PWM_BASE + 0x02*0x04)))
#define REG_APB1_PWM0_CAP_OUT 						(*((volatile unsigned long *)   (APB1_PWM_BASE + 0x03*0x04)))

#define REG_APB1_PWM1_VALUE_CFG 					(*((volatile unsigned long *)   (APB1_PWM_BASE + 0x04*0x04)))
#define REG_APB1_PWM1_CAP_OUT 						(*((volatile unsigned long *)   (APB1_PWM_BASE + 0x05*0x04)))
	

#define REG_APB1_PWM2_VALUE_CFG 					(*((volatile unsigned long *)   (APB1_PWM_BASE + 0x06*0x04)))
#define REG_APB1_PWM2_CAP_OUT 						(*((volatile unsigned long *)   (APB1_PWM_BASE + 0x07*0x04)))
	
#define REG_APB1_PWM3_VALUE_CFG 					(*((volatile unsigned long *)   (APB1_PWM_BASE + 0x08*0x04)))
#define REG_APB1_PWM3_CAP_OUT 						(*((volatile unsigned long *)   (APB1_PWM_BASE + 0x09*0x04)))
	
#define REG_APB1_PWM4_VALUE_CFG 					(*((volatile unsigned long *)   (APB1_PWM_BASE + 0x0a*0x04)))
#define REG_APB1_PWM4_CAP_OUT 						(*((volatile unsigned long *)   (APB1_PWM_BASE + 0x0b*0x04)))
	
#define REG_APB1_PWM5_VALUE_CFG 					(*((volatile unsigned long *)   (APB1_PWM_BASE + 0x0c*0x04)))
#define REG_APB1_PWM5_CAP_OUT 						(*((volatile unsigned long *)   (APB1_PWM_BASE + 0x0d*0x04)))
	
 

#define DC_VALUE_CFG(v)               (((v)&0xffff) << 16)
#define END_VALUE_CFG(v)               (((v)&0xffff) << 0)

#define PT0_MODE_BIT                    2
#define PT1_MODE_BIT                    6
#define PT2_MODE_BIT                    10
#define PT3_MODE_BIT                    14
#define PT4_MODE_BIT                    18
#define PT5_MODE_BIT                    22

