tuya/tuya-iotos-embeded-sdk-wifi-ble-bk7231n/platforms/bk7231n/bk7231n_os/beken378/driver/ble/ble_pub/plf/refip/src/arch/BK3435_reg.h
#define PT0_ENABLE_BIT                   0
#define PT1_ENABLE_BIT                   4
#define PT2_ENABLE_BIT                   8
#define PT3_ENABLE_BIT                   12
#define PT4_ENABLE_BIT                   16
#define PT5_ENABLE_BIT                   20

#define PT0_INT_ENABLE_BIT                1
#define PT1_INT_ENABLE_BIT                5
#define PT2_INT_ENABLE_BIT                9
#define PT3_INT_ENABLE_BIT                13
#define PT4_INT_ENABLE_BIT                17
#define PT5_INT_ENABLE_BIT                21

#define PT_CLK_DIV_BIT                  8
#define PT0_INT_FLAG                    (1<<0)
#define PT1_INT_FLAG                    (1<<1)
#define PT2_INT_FLAG                    (1<<2)
#define PT3_INT_FLAG                    (1<<3)
#define PT4_INT_FLAG                    (1<<4)
#define PT5_INT_FLAG                    (1<<5)
#define SET_PT_CLK_DIV                  (0xF << PT_CLK_DIV_BIT)


// PWM Test Firmware Definition
#define BK_PWM_MODE         0
#define BK_TIMER_MODE       1
#define BK_CAP_P_MODE       2
#define BK_CAP_N_MODE       3

#define PWM_CLK_SEL32K      0
#define PWM_CLK_SEL16M      1


//=====================================================================================


//SPI
#define REG_APB2_SPI_CTRL               (*((volatile unsigned long *)   0x00806200))
#define REG_APB2_SPI_STAT               (*((volatile unsigned long *)   0x00806204))
#define REG_APB2_SPI_DAT                (*((volatile unsigned long *)   0x00806208))

#define BIT_SPI_CTRL_SPIEN              23
#define BIT_SPI_CTRL_MSTEN              22
#define BIT_SPI_CTRL_CKPHA              21
#define BIT_SPI_CTRL_CKPOL              20
#define BIT_SPI_CTRL_BIT_WIDTH          18
#define BIT_SPI_CTRL_NSSMD              16
#define BIT_SPI_CTRL_SPI_CKR            8
#define BIT_SPI_CTRL_RXINT_EN           7
#define BIT_SPI_CTRL_TXINT_EN           6
#define BIT_SPI_CTRL_RXOVR_EN           5
#define BIT_SPI_CTRL_TXOVR_EN           4
#define BIT_SPI_CTRL_RXINT_MODE         2
#define BIT_SPI_CTRL_TXINT_MODE         0


#define BIT_SPI_STAT_SPI_BUSY	 15
#define BIT_SPI_STAT_SLVSEL             14
#define BIT_SPI_STAT_RXOVR              12
#define BIT_SPI_STAT_TXOVR              11
#define BIT_SPI_STAT_MODF               10
#define BIT_SPI_STAT_RXINT              9
#define BIT_SPI_STAT_TXINT              8
#define BIT_SPI_STAT_RXFIFO_FULL        3
#define BIT_SPI_STAT_RXFIFO_EMPTY       2
#define BIT_SPI_STAT_TXFIFO_FULL        1
#define BIT_SPI_STAT_TXFIFO_EMPTY       0

#define BIT_PMU_SPI_PWD                 (1<<0)

#define SPI_TX_FIFO_EMPTY             (REG_APB2_SPI_STAT & (0x01 << BIT_SPI_STAT_TXFIFO_EMPTY))
#define SPI_TX_FIFO_FULL                (REG_APB2_SPI_STAT & (0x01 << BIT_SPI_STAT_TXFIFO_FULL))
#define SPI_RX_FIFO_EMPTY             (REG_APB2_SPI_STAT & (0x01 << BIT_SPI_STAT_RXFIFO_EMPTY)) 
#define SPI_RX_FIFO_FULL                (REG_APB2_SPI_STAT & (0x01 << BIT_SPI_STAT_RXFIFO_FULL))

#define GET_SPI_TX_INT_STAT()       (REG_APB2_SPI_STAT & (0x01 << BIT_SPI_STAT_TXINT))
#define CLEAR_SPI_TX_INT_STAT()  ((REG_APB2_SPI_STAT &= ~(0x01 << BIT_SPI_STAT_TXINT)))


//=====================================================================================
// UART  
//=====================================================================================
#include "ble.h"
#if (BLE_DUT_UART_PORT == PORT_UART2)
#define REG_APB3_UART_CFG               (*((volatile unsigned long *)   0x00802200))
#define REG_APB3_UART_FIFO_CFG          (*((volatile unsigned long *)   0x00802204))
#define REG_APB3_UART_FIFO_STAT         (*((volatile unsigned long *)   0x00802208))
#define REG_APB3_UART_PORT              (*((volatile unsigned long *)   0x0080220C))
#define REG_APB3_UART_INT_ENABLE        (*((volatile unsigned long *)   0x00802210))
#define REG_APB3_UART_INT_STAT          (*((volatile unsigned long *)   0x00802214))
#define REG_APB3_UART_FLOW_CFG          (*((volatile unsigned long *)   0x00802218))
#define REG_APB3_UART_WAKERNEL_CFG      (*((volatile unsigned long *)   0x0080221c))
#else
#define REG_APB3_UART_CFG               (*((volatile unsigned long *)   0x00802100))
#define REG_APB3_UART_FIFO_CFG          (*((volatile unsigned long *)   0x00802104))
#define REG_APB3_UART_FIFO_STAT         (*((volatile unsigned long *)   0x00802108))
#define REG_APB3_UART_PORT              (*((volatile unsigned long *)   0x0080210C))
#define REG_APB3_UART_INT_ENABLE        (*((volatile unsigned long *)   0x00802110))
#define REG_APB3_UART_INT_STAT          (*((volatile unsigned long *)   0x00802114))
#define REG_APB3_UART_FLOW_CFG          (*((volatile unsigned long *)   0x00802118))
#define REG_APB3_UART_WAKERNEL_CFG      (*((volatile unsigned long *)   0x0080211c))
#endif // (BLE_DUT_UART_PORT == PORT_UART2)

#define BIT_UART_TX_ENABLE              0
#define BIT_UART_RX_ENABLE              1
#define BIT_UART_IRDA                   2
#define BIT_UART_LEN                    3
#define BIT_UART_PAR_EN                 5
#define BIT_UART_PAR_MODE               6
#define BIT_UART_STOP_LEN               7
#define BIT_UART_CLK_DIVID              8
#define SET_UART_TX_ENABLE              (0x1 << BIT_UART_TX_ENABLE)
#define SET_UART_TX_DISABLE             (0x0 << BIT_UART_TX_ENABLE)
#define SET_UART_RX_ENABLE              (0x1 << BIT_UART_RX_ENABLE)
#define SET_UART_RX_DISABLE             (0x0 << BIT_UART_RX_ENABLE)
#define SET_UART_IRDA                   (0x1 << BIT_UART_IRDA     )
#define SET_UART_LEN                    (0x3 << BIT_UART_LEN      )
#define SET_UART_PAR_EN                 (0x1 << BIT_UART_PAR_EN   )
#define SET_UART_PAR_MODE               (0x1 << BIT_UART_PAR_MODE )
#define SET_UART_STOP_LEN               (0x1 << BIT_UART_STOP_LEN )
#define SET_UART_CLK_DIVID              (0x1FFF<<BIT_UART_CLK_DIVID)

#define BIT_TX_FIFO_THRESHOLD           0
#define BIT_RX_FIFO_THRESHOLD           8
#define BIT_STOP_DETECT_TIME            16
#define SET_TX_FIFO_THRESHOLD           (0xFF<< BIT_TX_FIFO_THRESHOLD)
#define SET_RX_FIFO_THRESHOLD           (0xFF<< BIT_RX_FIFO_THRESHOLD)
#define SET_STOP_DETECT_TIME            (0x3 << BIT_STOP_DETECT_TIME)


#define BIT_TX_FIFO_COUNT               0
#define BIT_RX_FIFO_COUNT               8
#define SET_TX_FIFO_COUNT               (0xFF<< BIT_TX_FIFO_COUNT)
#define SET_RX_FIFO_COUNT               (0xFF<< BIT_RX_FIFO_COUNT)

#define BIT_UART_TX_FIFO_DIN            0
#define BIT_UART_RX_FIFO_DOUT           8
#define SET_UART_TX_FIFO_DIN            (0xFF<< BIT_UART_TX_FIFO_DIN )
#define SET_UART_RX_FIFO_DOUT           (0xFF<< BIT_UART_RX_FIFO_DOUT)

#define BIT_TX_FIFO_NEED_WRITE_EN       0
#define BIT_RX_FIFO_NEED_READ_EN        1
#define BIT_RX_FIFO_OVER_FLOW_EN        2
#define BIT_UART_RX_PARITY_ERR_EN       3
#define BIT_UART_RX_STOP_ERR_EN         4
#define BIT_UART_TX_STOP_END_EN         5
#define BIT_UART_RX_STOP_END_EN         6
#define BIT_UART_RXD_WAKEUP_EN          7
#define SET_TX_FIFO_NEED_WRITE_EN       (0x1 << BIT_TX_FIFO_NEED_WRITE_EN) 
#define SET_RX_FIFO_NEED_READ_EN        (0x1 << BIT_RX_FIFO_NEED_READ_EN ) 
#define SET_RX_FIFO_OVER_FLOW_EN        (0x1 << BIT_RX_FIFO_OVER_FLOW_EN ) 
#define SET_UART_RX_PARITY_ERR_EN       (0x1 << BIT_UART_RX_PARITY_ERR_EN) 
#define SET_UART_RX_STOP_ERR_EN         (0x1 << BIT_UART_RX_STOP_ERR_EN  ) 
#define SET_UART_TX_STOP_END_EN         (0x1 << BIT_UART_TX_STOP_END_EN  ) 
#define SET_UART_RX_STOP_END_EN         (0x1 << BIT_UART_RX_STOP_END_EN  ) 
#define SET_UART_RXD_WAKEUP_EN          (0x1 << BIT_UART_RXD_WAKEUP_EN   ) 

#define BIT_TX_FIFO_NEED_WRITE_FLAG     0
#define BIT_RX_FIFO_NEED_READ_FLAG      1
#define BIT_RX_FIFO_OVER_FLOW_FLAG      2
#define BIT_UART_RX_PARITY_ERR_FLAG     3
#define BIT_UART_RX_STOP_ERR_FLAG       4
#define BIT_UART_TX_STOP_END_FLAG       5
#define BIT_UART_RX_STOP_END_FLAG       6
#define BIT_UART_RXD_WAKEUP_FLAG        7
//=====================================================================================



//IIC
#define REG_APB4_I2C_CN                 (*((volatile unsigned long *)   0x00806400))
#define REG_APB4_I2C_STAT               (*((volatile unsigned long *)   0x00806404))
#define REG_APB4_I2C_DAT                (*((volatile unsigned long *)   0x00806408))

#define I2C_STATUS_START			(0x1 << 10)
#define I2C_STATUS_STOP			(0x1 << 9)
#define I2C_STATUS_SI				(0x1 << 0)
#define I2C_STATUS_BUSY			(0x1 << 15)




