tuya/tuya-iotos-embeded-sdk-wifi-ble-bk7231n/platforms/bk7231n/bk7231n_os/beken378/driver/ble/ble_pub/plf/refip/src/arch/BK3435_reg.h
#define AUDIO_CONFIG			(*((volatile unsigned long *) (APBC_AUDIO_BASE + 0X0 * 0X04)))
	
#define ADC_CONFIG_0			(*((volatile unsigned long *) (APBC_AUDIO_BASE + 0X4 * 0X04)))
#define ADC_CONFIG_1			(*((volatile unsigned long *) (APBC_AUDIO_BASE + 0X5 * 0X04)))
#define ADC_CONFIG_2			(*((volatile unsigned long *) (APBC_AUDIO_BASE + 0X6 * 0X04)))
#define ADC_FIFO_CONFIG			(*((volatile unsigned long *) (APBC_AUDIO_BASE + 0XA * 0X04)))

#define AGC_CONFIG_0			(*((volatile unsigned long *) (APBC_AUDIO_BASE + 0XB * 0X04)))
#define AGC_CONFIG_1			(*((volatile unsigned long *) (APBC_AUDIO_BASE + 0XC * 0X04)))
#define AGC_CONFIG_2			(*((volatile unsigned long *) (APBC_AUDIO_BASE + 0XD * 0X04)))
 
#define ADC_STAUTS				(*((volatile unsigned long *) (APBC_AUDIO_BASE + 0XE * 0X04)))
#define AGC_STAUTS				(*((volatile unsigned long *) (APBC_AUDIO_BASE + 0XF * 0X04)))


#define ADC_FPORT				(*((volatile unsigned long *) (APBC_AUDIO_BASE + 0X11 * 0X04)))
 

#define ADC_ENABLE_BIT   3


#define ADC_CFG0_HPF2_COEF_B2_BIT	0
#define ADC_CFG0_HPF2_BYPASS_BIT	16
#define ADC_CFG0_HPF1_BYPASS_BIT	17
#define ADC_CFG0_SET_GAIN_BIT		18
#define ADC_CFG0_SAMPE_EDGE_BIT		24


#define ADC_CFG1_HPF2_COEF_B0_BIT	0
#define ADC_CFG1_HPF2_COEF_B1_BIT	16 

#define ADC_CFG2_HPF2_COEF_A0_BIT	0
#define ADC_CFG2_HPF2_COEF_A1_BIT	16 

#define ADC_FIFO_THRESHOLD_BIT		15
#define ADC_FIFO_INT_EN_BIT			23

#define AGC_CFG0_NOISE_THRD_BIT	0
#define AGC_CFG0_NOISE_HIGH_BIT	10
#define AGC_CFG0_NOISE_LOW_BIT	20
#define AGC_CFG0_SET_BIT	30 


#define AGC_CFG1_NOISE_MIN_BIT	0
#define AGC_CFG1_NOISE_TOUT_BIT	7 
#define AGC_CFG1_HIGH_DUR_BIT	10  
#define AGC_CFG1_LOW_DUR_BIT	13 
#define AGC_CFG1_MIN_BIT		16 
#define AGC_CFG1_MAX_BIT		23 
#define AGC_CFG1_NG_METHOD_BIT	30 
#define AGC_CFG1_NG_ENABLE_BIT	31 

#define AGC_CFG2_DELAY_TIME_BIT	0 
#define AGC_CFG2_ATTACK_TIME_BIT	3
#define AGC_CFG2_HIGH_THRD_BIT	6
#define AGC_CFG2_LOW_THRD_BIT	11
#define AGC_CFG2_IIR_COEF_BIT	16
#define AGC_CFG2_ENABLE_BIT		19
#define AGC_CFG2_MANUAL_PGA_VALUE_BIT	20
#define AGC_CFG2_MANUAL_PGA_BIT	27


#define ADC_STATUS_NEAR_FULL_BIT	2
#define ADC_STATUS_NEAR_EMPTY_BIT	6
#define ADC_STATUS_FIFO_FULL_BIT	10
#define ADC_STATUS_FIFO_EMPTY_BIT	14
#define ADC_STATUS_INT_FLAG_BIT	18

#define AGC_STATUS_RSSI_BIT	2
#define AGC_STATUS_MIC_PGA_BIT	8
#define AGC_STATUS_MIC_RSSI_BIT	16



//FLASH/RAM space (program)
#define FLASH_ADDR0                     (*((volatile unsigned long *)   0x0000F000))
#define FLASH_ADDR1                     (*((volatile unsigned long *)   0x0000F100))
#define FLASH_ADDR2                     (*((volatile unsigned long *)   0x0000F200))
#define FLASH_ADDR3                     (*((volatile unsigned long *)   0x0000F300))


//===========================================================================================
//XVR

//===========================================================================================
// Analog RF module + Transceiver Registers
//===========================================================================================
//Analog SPI Registers
#define APB_XVER_BASE    0x00801400
#define XVR_REG00               (*((volatile unsigned int *)   (APB_XVER_BASE+0x0)))
#define XVR_REG01               (*((volatile unsigned int *)   (APB_XVER_BASE+0x4)))
#define XVR_REG02               (*((volatile unsigned int *)   (APB_XVER_BASE+0x8)))
#define XVR_REG03               (*((volatile unsigned int *)   (APB_XVER_BASE+0xC)))

#define XVR_REG04               (*((volatile unsigned int *)   (APB_XVER_BASE+0x10)))
#define XVR_REG05               (*((volatile unsigned int *)   (APB_XVER_BASE+0x14)))
#define XVR_REG06               (*((volatile unsigned int *)   (APB_XVER_BASE+0x18)))
#define XVR_REG07               (*((volatile unsigned int *)   (APB_XVER_BASE+0x1C)))

#define XVR_REG08               (*((volatile unsigned int *)   (APB_XVER_BASE+0x20)))
#define XVR_REG09               (*((volatile unsigned int *)   (APB_XVER_BASE+0x24)))
#define XVR_REG0A               (*((volatile unsigned int *)   (APB_XVER_BASE+0x28)))
#define XVR_REG0B               (*((volatile unsigned int *)   (APB_XVER_BASE+0x2C)))

#define XVR_REG0C               (*((volatile unsigned int *)   (APB_XVER_BASE+0x30)))
#define XVR_REG0D               (*((volatile unsigned int *)   (APB_XVER_BASE+0x34)))
#define XVR_REG0E               (*((volatile unsigned int *)   (APB_XVER_BASE+0x38)))
#define XVR_REG0F               (*((volatile unsigned int *)   (APB_XVER_BASE+0x3C)))

// Read-Back Registers
#define XVR_REG10                (*((volatile unsigned int *)   (APB_XVER_BASE+0x40)))
#define XVR_REG11                (*((volatile unsigned int *)   (APB_XVER_BASE+0x44)))
#define XVR_REG12                (*((volatile unsigned int *)   (APB_XVER_BASE+0x48)))
#define XVR_REG13                (*((volatile unsigned int *)   (APB_XVER_BASE+0x4C)))

#define XVR_REG14                (*((volatile unsigned int *)   (APB_XVER_BASE+0x50)))
#define XVR_REG15                (*((volatile unsigned int *)   (APB_XVER_BASE+0x54)))
#define XVR_REG16                (*((volatile unsigned int *)   (APB_XVER_BASE+0x58)))
#define XVR_REG17                (*((volatile unsigned int *)   (APB_XVER_BASE+0x5C)))

#define XVR_REG18                (*((volatile unsigned int *)   (APB_XVER_BASE+0x60)))
#define XVR_REG19                (*((volatile unsigned int *)   (APB_XVER_BASE+0x64)))
#define XVR_REG1A                (*((volatile unsigned int *)   (APB_XVER_BASE+0x68)))
#define XVR_REG1B                (*((volatile unsigned int *)   (APB_XVER_BASE+0x6C)))

#define XVR_REG1C                (*((volatile unsigned int *)   (APB_XVER_BASE+0x70)))
#define XVR_REG1D                (*((volatile unsigned int *)   (APB_XVER_BASE+0x74)))
#define XVR_REG1E                (*((volatile unsigned int *)   (APB_XVER_BASE+0x78)))
#define XVR_REG1F                (*((volatile unsigned int *)   (APB_XVER_BASE+0x7C)))

// XVR Config Registers 
#define XVR_REG20                      (*((volatile unsigned int *)   (APB_XVER_BASE+0x80)))
#define XVR_REG21                      (*((volatile unsigned int *)   (APB_XVER_BASE+0x84)))
#define XVR_REG22                      (*((volatile unsigned int *)   (APB_XVER_BASE+0x88)))
#define XVR_REG23                      (*((volatile unsigned int *)   (APB_XVER_BASE+0x8C)))

#define XVR_REG24                      (*((volatile unsigned int *)   (APB_XVER_BASE+0x90)))
#define XVR_REG25                      (*((volatile unsigned int *)   (APB_XVER_BASE+0x94)))
#define XVR_REG26                      (*((volatile unsigned int *)   (APB_XVER_BASE+0x98)))
#define XVR_REG27                      (*((volatile unsigned int *)   (APB_XVER_BASE+0x9C)))

#define XVR_REG28                      (*((volatile unsigned int *)   (APB_XVER_BASE+0xA0)))
#define XVR_REG29                      (*((volatile unsigned int *)   (APB_XVER_BASE+0xA4)))
#define XVR_REG2A                      (*((volatile unsigned int *)   (APB_XVER_BASE+0xA8)))
#define XVR_REG2B                      (*((volatile unsigned int *)   (APB_XVER_BASE+0xAC)))

#define XVR_REG2C                      (*((volatile unsigned int *)   (APB_XVER_BASE+0xB0)))
#define XVR_REG2D                      (*((volatile unsigned int *)   (APB_XVER_BASE+0xB4)))
#define XVR_REG2E                      (*((volatile unsigned int *)   (APB_XVER_BASE+0xB8)))
#define XVR_REG2F                      (*((volatile unsigned int *)   (APB_XVER_BASE+0xBC)))

#define XVR_REG30                      (*((volatile unsigned int *)   (APB_XVER_BASE+0xC0)))
#define XVR_REG31                      (*((volatile unsigned int *)   (APB_XVER_BASE+0xC4)))
#define XVR_REG32                      (*((volatile unsigned int *)   (APB_XVER_BASE+0xC8)))
#define XVR_REG33                      (*((volatile unsigned int *)   (APB_XVER_BASE+0xCC)))

#define XVR_REG34                      (*((volatile unsigned int *)   (APB_XVER_BASE+0xD0)))
#define XVR_REG35                      (*((volatile unsigned int *)   (APB_XVER_BASE+0xD4)))
#define XVR_REG36                      (*((volatile unsigned int *)   (APB_XVER_BASE+0xD8)))
#define XVR_REG37                      (*((volatile unsigned int *)   (APB_XVER_BASE+0xDC)))

#define XVR_REG38                      (*((volatile unsigned int *)   (APB_XVER_BASE+0xE0)))
#define XVR_REG39                      (*((volatile unsigned int *)   (APB_XVER_BASE+0xE4)))
#define XVR_REG3A                      (*((volatile unsigned int *)   (APB_XVER_BASE+0xE8)))
#define XVR_REG3B                      (*((volatile unsigned int *)   (APB_XVER_BASE+0xEC)))

#define XVR_REG3C                      (*((volatile unsigned int *)   (APB_XVER_BASE+0xF0)))
#define XVR_REG3D                      (*((volatile unsigned int *)   (APB_XVER_BASE+0xF4)))
#define XVR_REG3E                      (*((volatile unsigned int *)   (APB_XVER_BASE+0xF8)))
#define XVR_REG3F                      (*((volatile unsigned int *)   (APB_XVER_BASE+0xFC)))

#define XVR_REG40                      (*((volatile unsigned int *)   (APB_XVER_BASE+0x100)))
#define XVR_REG41                      (*((volatile unsigned int *)   (APB_XVER_BASE+0x104)))
#define XVR_REG42                      (*((volatile unsigned int *)   (APB_XVER_BASE+0x108)))
#define XVR_REG43                      (*((volatile unsigned int *)   (APB_XVER_BASE+0x10C)))

#define XVR_REG44                      (*((volatile unsigned int *)   (APB_XVER_BASE+0x110)))
#define XVR_REG45                      (*((volatile unsigned int *)   (APB_XVER_BASE+0x114)))
#define XVR_REG46                      (*((volatile unsigned int *)   (APB_XVER_BASE+0x118)))
#define XVR_REG47                      (*((volatile unsigned int *)   (APB_XVER_BASE+0x11C)))

