tuya/tuya-iotos-embeded-sdk-wifi-ble-bk7231n/platforms/bk7231n/bk7231n_os/beken378/driver/ble/ble_pub/plf/refip/src/arch/BK3435_reg.h
#define XVR_REG48                      (*((volatile unsigned int *)   (APB_XVER_BASE+0x120)))
#define XVR_REG49                      (*((volatile unsigned int *)   (APB_XVER_BASE+0x124)))
#define XVR_REG4A                      (*((volatile unsigned int *)   (APB_XVER_BASE+0x128)))
#define XVR_REG4B                      (*((volatile unsigned int *)   (APB_XVER_BASE+0x12C)))

#define XVR_REG4C                      (*((volatile unsigned int *)   (APB_XVER_BASE+0x130)))
#define XVR_REG4D                      (*((volatile unsigned int *)   (APB_XVER_BASE+0x134)))
#define XVR_REG4E                      (*((volatile unsigned int *)   (APB_XVER_BASE+0x138)))
#define XVR_REG4F                      (*((volatile unsigned int *)   (APB_XVER_BASE+0x13C)))


/// backup analog register
//extern u_int32 backup_xvr_analog_reg[];
#define mHWreg_Assign_XVR_Regsiter(No,Value) \
    { \
        XVR_REG##No = Value; \
    }
		

#define REG_AHB1_XVER_BASE              (*((volatile unsigned long *)   0x00801488))

#define BIT_AUTO_SYNCWORD               (0x1<<31)
#define BIT_AUTO_SYNCWIN                (0x1<<30)
#define BIT_AUTO_CHNN                   (0x1<<29)


//RW////////////////////////////////////////////////////////////////////////////////
#define REG_AHB10_RW_INT_MASK        (*((volatile unsigned long *)   0x0081000C))
#define REG_AHB10_RW_INT_FLAG          (*((volatile unsigned long *)   0x00810010))
#define REG_AHB10_RW_INT_FLAG_RAW          (*((volatile unsigned long *)   0x00810014))	
#define REG_AHB10_RW_INT_ACK        (*((volatile unsigned long *)   0x00810018))
#define REG_AHB10_RW_BASETIMECNT    (*((volatile unsigned long *)   0x0081001C))
#define REG_AHB10_RW_DEEPSLCNTL     (*((volatile unsigned long *)   0x00810030))
#define REG_AHB10_RW_DEEPSLTIME     (*((volatile unsigned long *)   0x00810034))
#define REG_AHB10_RW_DEEPSLDUR     (*((volatile unsigned long *)   0x00810038))
#define REG_AHB10_RW_ENBPRESET     (*((volatile unsigned long *)   0x0081003C))
#define REG_AHB10_RW_FINECNTCORR     (*((volatile unsigned long *)   0x00810040))
#define REG_AHB10_RW_BASETIMECNTCORR  (*((volatile unsigned long *)   0x00810044))
#define REG_AHB10_RW_ERRORTYPESTAT    (*((volatile unsigned long *)   0x00810060))


#define INT_RW_AUDIOINT2STAT_MASK      (0x01<<12)
#define INT_RW_AUDIOINT1STAT_MASK      (0x01<<11)
#define INT_RW_AUDIOINT0STAT_MASK      (0x01<< 10)
#define INT_RW_SWINTSTAT_MASK          (0x01<< 9)
#define INT_RW_EVENTAPFAINTSTAT_MASK      (0x01<< 8)
#define INT_RW_FINETGTIMINTSTAT_MASK      (0x01<< 7)
#define INT_RW_GROSSTGTIMINTSTAT_MASK     (0x01<< 6)
#define INT_RW_ERRORINTSTAT_MASK     (0x01<< 5)
#define INT_RW_CRYPTINTSTAT_MASK     (0x01<< 4)
#define INT_RW_EVENTINTSTAT_MASK     (0x01<< 3)
#define INT_RW_SLPINTSTAT_MASK       (0x01<< 2)
#define INT_RW_RXINTSTAT_MASK        (0x01<< 1)
#define INT_RW_CSCNTINTSTAT_MASK     (0x01<< 0)
#define INT_RW_AUDIOINT2STAT_bit      (0x01<<12)
#define INT_RW_AUDIOINT1STAT_bit      (0x01<<11)
#define INT_RW_AUDIOINT0STAT_bit      (0x01<< 10)
#define INT_RW_SWINTSTAT_bit          (0x01<< 9)
#define INT_RW_EVENTAPFAINTSTAT_bit      (0x01<< 8)
#define INT_RW_FINETGTIMINTSTAT_bit      (0x01<< 7)
#define INT_RW_GROSSTGTIMINTSTAT_bit     (0x01<< 6)
#define INT_RW_ERRORINTSTAT_bit     (0x01<< 5)
#define INT_RW_CRYPTINTSTAT_bit     (0x01<< 4)
#define INT_RW_EVENTINTSTAT_bit     (0x01<< 3)
#define INT_RW_SLPINTSTAT_bit       (0x01<< 2)
#define INT_RW_RXINTSTAT_bit        (0x01<< 1)
#define INT_RW_CSCNTINTSTAT_bit     (0x01<< 0)

#define RW_ENBPRESET_TWEXT_bit     21
#define RW_ENBPRESET_TWOSC_bit     10
#define RW_ENBPRESET_TWRW_bit     0

#endif

